// №109 Дано натуральное число n. Вычислить 1*2 + 2*3*4 + ...+n(n+1)...*2n

// У мене виникли проблеми з розумінням послідовності. n(n+1)*2n для n = 1 це 1*(1+1)*(2*1), тобто 1*2*2 = 4, а не як в умові 1*2 = 2. Тому значення для 1 я захардкоджу, для значеня "2" формула сходиться 2*(2+1)*(2*2) = 2*3*4, як у прикладі. Шкода, що не показали логіку для n=3. Сподіваюсь, що для n=3 результат має бути 3*(3+1)*2*3. Тобто для "3" відповідь 3*4*6 плюс попередні значення, а саме 1*2 (для n=1) + 2*3*4 (для n=2), тобто загалом 98.

let task1 = (number) => {
  let sum = 0
  for (let i = 1; i <= number; i++) {
    sum += i * (i + 1) * (2 * i)
  }
  if (!Number.isInteger(number) || number < 0) {
    return console.log('Дано не натуральное число')
  } else {
    // -2 тому що по формулі n(n+1)*2n для n=1 результат 4, а не 2 як в прикладі.
    return sum - 2
  }
}

module.exports = task1
